

# Main text
GREATING_TEXT = """
Вітаю! 
Я можу дізнаватись для вас чи є світло в домі. Я отримую данні з електромережі 
однієї із квартир в домі майже в реальному часі. 

Іноді я можу помилятись. Чому це може трапитись? Тому що інформація про наявність світла передається інтернетом. 
Технічно неможливо відрізнити відсутність інтернета та відсутність світла.

А ще я можу відправляти вам повідомлення коли світло зʼявляється чи зникає. Якщо ви хочете отримувати повідомлення оберіть пункт "Підписатись"
або відправьте команду /subscribe (щоб перестати отримувати повідомлення /unsubscribe)

Команди:
/start – отримати підказку
/status – дізнатись чи є світло
/subscribe –підписатись на автоматичне сповіщення
/unsubscribe – відписатись від автоматичного сповіщення

"""

# Add subscription
THANKS_FOR_SUBSCRIPTION = "Дякую що підписалися"
SUBSCRIPTION_WITH_ERROR = "Дякую що підписалися. Щось пішло не так, але ми спробуємо це виправити і підписати вас"
YOU_HAVE_SUBSCRIBED = "Ви вже підписані"

# Remove subscription
UNSIBSCRIBE_MESSAGE = "Ми відписали вас. Ви більше не будете отримувати сповіщення"
UNSIBSCRIBE_MESSAGE_NO_USER = "Схоже що ми вас вже відписали. Ви більше не будете отримувати сповіщення"

# Statu texts
ELECTRICITY_OK = "⚡ 💡 Світло є! {0}"
ELECTRICITY_FAIL = "🪫 Світла немає. {0}"
ELECTRICITY_UNKNOWN = "🤷 Поки не ясно. Схоже на помилку, зараз розбиремось"

# Status notification
ELECTRICITY_BACK = "⚡⚡⚡ Світло повернулось ⚡⚡⚡"
ELECTRICITY_GONE = "🪫🪫🪫 Ох, як прикро 🪫🪫🪫 Схоже що електрика зникла"


